Server/HackTestWPF/Xmls/CancelAppointment.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"
       xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <t:TimeZoneContext>
      <t:TimeZoneDefinition Name="Uruguay Standard Time" Id="Uruguay Standard Time">
        <t:Periods>
          <t:Period Bias="P0DT3H0M0.0S" Name="Standard" Id="Std" />
        </t:Periods>
        <t:TransitionsGroups>
          <t:TransitionsGroup Id="0">
            <t:AbsoluteDateTransition>
              <t:To Kind="Period">Std</t:To>
              <t:DateTime>2007-01-01T08:00:00.000Z</t:DateTime>
            </t:AbsoluteDateTransition>
          </t:TransitionsGroup>
        </t:TransitionsGroups>
        <t:Transitions>
          <t:Transition>
            <t:To Kind="Group">0</t:To>
          </t:Transition>
        </t:Transitions>
      </t:TimeZoneDefinition>
    </t:TimeZoneContext>
  </soap:Header>
  <soap:Body>
    <m:DeleteItem DeleteType="MoveToDeletedItems" SendMeetingCancellations="SendToAllAndSaveCopy">
      <m:ItemIds>
        <t:ItemId Id="{0}" ChangeKey="{1}"/>
      </m:ItemIds>
    </m:DeleteItem>
  </soap:Body>
</soap:Envelope>


